/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[Alla datum]@";
"%@ %[Today]@" = "%1$@ %2$[Idag]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[Sedan igår]@";
"%@ %[This week]@" = "%1$@ %2$[Den här veckan]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[Senaste två veckorna]@";
"%@ %[This month]@" = "%1$@ %2$[Den här månaden]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[Senaste två månaderna]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[Alla]@";
"%@ %[Yes]@" = "%1$@ %2$[Ja]@";
"%@ %[No]@" = "%1$@ %2$[Nej]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[Innehåller]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[Börjar med]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[Slutar med]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[Är]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[Exakt]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[Före]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[Efter]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[Större än]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[Mindre än]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[de senaste]@ %3$@ %4$[dagarna]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[de senaste]@ %3$@ %4$[veckorna]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[de senaste]@ %3$@ %4$[månaderna]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[de senaste]@ %3$@ %4$[åren]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[Färgrymd]@ %2$[Alla färgrymder]@";
"%[Color Space]@ %[RGB]@" = "%1$[Färgrymd]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[Färgrymd]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[Färgrymd]@ %2$[Gråskala]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[Innehåll]@ innehåller %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Längd]@ %2$[Längre än]@ %3$@ %4$[min]@ %5$@ %6$[sek]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Längd]@ %2$[Kortare än]@ %3$@ %4$[min]@ %5$@ %6$[sek]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[Nyckelord]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[Nyckelord]@ innehåller %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[Typ]@ är %2$[alla]@";
"%[Kind]@ is %[Images]@" = "%1$[Typ]@ är %2$[bilder]@";
"%[Kind]@ is %[Text]@" = "%1$[Typ]@ är %2$[text]@";
"%[Kind]@ is %[PDF]@" = "%1$[Typ]@ är %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[Typ]@ är %2$[filmer]@";
"%[Kind]@ is %[Music]@" = "%1$[Typ]@ är %2$[musik]@";
"%[Kind]@ is %[Documents]@" = "%1$[Typ]@ är %2$[dokument]@";
"%[Kind]@ is %[Presentations]@" = "%1$[Typ]@ är %2$[presentationer]@";
"%[Kind]@ is %[Folders]@" = "%1$[Typ]@ är %2$[mappar]@";
"%[Kind]@ is %[Applications]@" = "%1$[Typ]@ är %2$[program]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[Typ]@ är %2$[annan...]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[Märkning]@ är %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[Senast öppnad]@ %2$[alla datum]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[Senast ändrad]@ %2$[alla datum]@";
"%[Created]@ %[Any Date]@" = "%1$[Skapad]@ %2$[alla datum]@";
"%[Last Opened]@ %[Today]@" = "%1$[Senast öppnad]@ %2$[idag]@";
"%[Last Modified]@ %[Today]@" = "%1$[Senast ändrad]@ %2$[idag]@";
"%[Created]@ %[Today]@" = "%1$[Skapad]@ %2$[idag]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[Senast öppnad]@ %2$[sedan igår]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[Senast ändrad]@ %2$[sedan igår]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[Skapad]@ %2$[sedan igår]@";
"%[Last Opened]@ %[This week]@" = "%1$[Senast öppnad]@ %2$[den här veckan]@";
"%[Last Modified]@ %[This week]@" = "%1$[Senast ändrad]@ %2$[den här veckan]@";
"%[Created]@ %[This week]@" = "%1$[Skapad]@ %2$[den här veckan]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[Senast öppnad]@ %2$[senaste två veckorna]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[Senast ändrad]@ %2$[senaste två veckorna]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[Skapad]@ %2$[senaste två veckorna]@";
"%[Last Opened]@ %[This month]@" = "%1$[Senast öppnad]@ %2$[den här månaden]@";
"%[Last Modified]@ %[This month]@" = "%1$[Senast ändrad]@ %2$[den här månaden]@";
"%[Created]@ %[This month]@" = "%1$[Skapad]@ %2$[den här månaden]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[Senast öppnad]@ %2$[senaste två månaderna]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[Senast ändrad]@ %2$[senaste två månaderna]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[Skapad]@ %2$[senaste två månaderna]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[Senast öppnad]@ %2$[exakt]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[Senast ändrad]@ %2$[exakt]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[Skapad]@ %2$[exakt]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[Senast öppnad]@ %2$[före]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[Senast ändrad]@ %2$[före]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[Skapad]@ %2$[före]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[Senast öppnad]@ %2$[efter]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[Senast ändrad]@ %2$[efter]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[Skapad]@ %2$[efter]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[Senast öppnad]@ %2$[de senaste]@ %3$@ %4$[dagarna]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[Senast ändrad]@ %2$[de senaste]@ %3$@ %4$[dagarna]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[Skapad]@ %2$[de senaste]@ %3$@ %4$[dagarna]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Senast öppnad]@ %2$[de senaste]@ %3$@ %4$[veckorna]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Senast ändrad]@ %2$[de senaste]@ %3$@ %4$[veckorna]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Skapad]@ %2$[de senaste]@ %3$@ %4$[veckorna]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[Senast öppnad]@ %2$[de senaste]@ %3$@ %4$[månaderna]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[Senast ändrad]@ %2$[de senaste]@ %3$@ %4$[månaderna]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[Skapad]@ %2$[de senaste]@ %3$@ %4$[månaderna]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[Senast öppnad]@ %2$[de senaste]@ %3$@ %4$[åren]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[Senast ändrad]@ %2$[de senaste]@ %3$@ %4$[åren]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[Skapad]@ %2$[de senaste]@ %3$@ %4$[åren]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[Musikgenre]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[Filnamnstillägg]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[Namn]@ %2$[innehåller]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[Namn]@ %2$[börjar med]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[Namn]@ %2$[slutar med]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[Namn]@ %2$[är]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[Riktning]@ %2$[Alla riktningar]@";
"%[Orientation]@ %[Landscape]@" = "%1$[Riktning]@ %2$[Liggande]@";
"%[Orientation]@ %[Portrait]@" = "%1$[Riktning]@ %2$[Stående]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[Annat...]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Råsökning]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[Sök efter]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[Storlek]@ %2$[större än]@ %3$@ %4$[K]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[Storlek]@ %2$[mindre än]@ %3$@ %4$[K]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[Storlek]@ %2$[större än]@ %3$@ %4$[MB]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[Storlek]@ %2$[mindre än]@ %3$@ %4$[MB]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[Storlek]@ %2$[större än]@ %3$@ %4$[GB]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[Storlek]@ %2$[mindre än]@ %3$@ %4$[GB]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[Synlighet]@ %2$[Synliga eller osynliga]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[Synlighet]@ %2$[Synliga objekt]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[Synlighet]@ %2$[Osynliga objekt]@";

